docs/posts/2017-11-30-ethics-of-war-handout.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 30, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ethics of War Handout</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Ethics of War Handout</h1>
<p class="subtitle" role="doc-subtitle">Nov 30, 2017</p>
</header><p>
These are some concepts and terms used in a presentation on the ethics of war, given at Oklahoma Baptist University on December 1, 2017.
</p>
<section id="outline-container-org044bcc9" class="outline-2">
<h2 id="org044bcc9">Pacifism</h2>
<div class="outline-text-2" id="text-org044bcc9">
<dl class="org-dl">
<dt>Consequentialist Pacifism:</dt><dd>Although war is not intrinsically wrong, the benefits of war are always outweighed by the costs.</dd>
<dt>Deontological Pacifism:</dt><dd>War is always intrinsically wrong, regardless of its consequences.</dd>
</dl>
</div>
</section>
<section id="outline-container-org5112077" class="outline-2">
<h2 id="org5112077">Doctrine of Double Effect</h2>
<div class="outline-text-2" id="text-org5112077">
<p>
War could be permissible, even if we know that innocent lives will be lost, if
</p>

<ol class="org-ol">
<li>Taking innocent life is not the reason that we go to war,</li>
<li>The lives that are saved are proportionally greater than the lives that will be lost,</li>
<li>Taking innocent life is not the means to saving lives, and</li>
<li>Saving lives is otherwise permissible.</li>
</ol>
</div>
</section>
<section id="outline-container-org98cdd3c" class="outline-2">
<h2 id="org98cdd3c">Just War</h2>
<div class="outline-text-2" id="text-org98cdd3c">
<dl class="org-dl">
<dt>Jus ad bellum:</dt><dd>Conditions that determine when a state can justly go to war.</dd>
<dt>Jus in bello:</dt><dd>Conditions that specify how a war must be fought</dd>
<dt>Jus post bellum:</dt><dd>Conditions that determine when one can justly end hostilities.</dd>
</dl>
</div>
<div id="outline-container-org8522551" class="outline-3">
<h3 id="org8522551">Jus ad bellum</h3>
<div class="outline-text-3" id="text-org8522551">
<ul class="org-ul">
<li>Just cause</li>
<li>Right intention</li>
<li>Proper authority/declaration</li>
<li>Last resort</li>
<li>Probability of success</li>
<li>Proportionality</li>
</ul>
</div>
</div>
<div id="outline-container-org15a5a36" class="outline-3">
<h3 id="org15a5a36">Jus in bello</h3>
<div class="outline-text-3" id="text-org15a5a36">
<ul class="org-ul">
<li>Obey international law</li>
<li>Discrimination</li>
<li>Proportionality</li>
<li>Humane treatment of POW’s</li>
<li>No means <i>mala in se</i></li>
</ul>
</div>
</div>
<div id="outline-container-org54ac54e" class="outline-3">
<h3 id="org54ac54e">Jus post bellum</h3>
<div class="outline-text-3" id="text-org54ac54e">
<ul class="org-ul">
<li>Just cause</li>
<li>Right intention</li>
<li>Discrimination</li>
<li>Proportionality</li>
<li>No reprisals</li>
</ul>
</div>
</div>
</section>
<section id="outline-container-orgdf7a46e" class="outline-2">
<h2 id="orgdf7a46e">Just Peacemaking</h2>
<div class="outline-text-2" id="text-orgdf7a46e">
<p>
Ten principles of just peacemaking:<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
</p>

<ol class="org-ol">
<li>Support nonviolent direct action.</li>
<li>Take independent initiatives to reduce threat.</li>
<li>Use cooperative conflict resolution.</li>
<li>Acknowledge responsibility for conflict and injustice and seek repentance and forgiveness.</li>
<li>Advance democracy, human rights, and religious liberty.</li>
<li>Foster just and sustainable economic development.</li>
<li>Work with emerging cooperative forces in the international system.</li>
<li>Strengthen the United Nations and international efforts for cooperation and human rights.</li>
<li>Reduce offensive weapons and weapons trade.</li>
<li>Encourage grassroots peacemaking groups and voluntary associations.</li>
</ol>


<div class="tagline" id="orge59b7da">
<p>
Tagged: <a href="../tags/ethics.html">Ethics</a> <a href="../tags/politics.html">Politics</a>
</p>

</div>
</div>
</section>
<div id="footnotes">
<h2 class="footnotes">Footnotes</h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
From <i>Just Peacemaking: Ten Practices for Abolishing War</i>, 2d ed., edited by Glen Stassen (Pilgrim Press, 2004).
</p></div></div>


</div>
</div></main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 30, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
